org/pomodorocoder.org
#+TITLE: Pomodoro Coder

#+HUGO_BASE_DIR: ./temp/
#+HUGO_SECTION: ./
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

***** Pure Functions
:PROPERTIES:
:EXPORT_FILE_NAME: pure-functions
:EXPORT_DATE: <2017-11-13 Mon>
:END:
****** Objectives
       - Define Pure Functions

****** Pure Function Definition
       - A function with no side effects
       - It does not modify its inputs
       - It's repeatable
       - To generate the outputs, we don't need to change the inputs

****** Example A.1: Not a Pure Function
       - The code below is not a pure function as it changes the values in the input array
       - It is not repeatable: if we run the function multiple times it won't generate the same results
#+begin_src js
function doubleVals(arr) {
    for(var i = 0; i < arr.length; i++) {
        arr[i] = arr[i] * 2;    // Note here, the value of input array is changed
    }
    return arr;
}
#+end_src

****** Example A.2: A Pure Function
       - Can use the ~map~ method which returns an array
       - The input value is not changed
       - The process is repeatable: with same input array, will always generate the same output array
#+begin_src js
function doubleVals(arr){
    return arr.map(d => d * 2);
}
#+end_src

****** Example B.1: Not a Pure Function
       - In the case below, we are modifying global state
       - Will add a property called job to the person object
#+begin_src js
var person = {id: 53, name: "Iza"};

function addJob(job){
    person.job = job;
}
addJob("Data Scientist");
#+end_src

****** Example B.2: Pure Function
#+begin_src js
var person = {id: 88, name: "Iza"};

function addJob(personObj, job){
    return Object.assign(
        {}, personObj, {job}
    );
}
addJob(person, "Data Scientist");
#+end_src

****** Example B.3: Use Object Spread operator for the Pure Function

#+begin_src js
var person = {id: 88, name: "Iza"}

function addJob(personObj, job){
    return(...personObj, job); //Spread operator puts all the keys and values from personObj and put them into the new object we are creating
} 
addJob(person, "Data Scientist")
#+end_src

****** Pure function with React
       - All changes to this.state should be pure

